## Plan Result (test-apim)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 2 to destroy.</code></pre>

* Update
  * module.api-mgmt.azurerm_public_ip.apim
* Replace
  * module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain
  * module.api-mgmt.azurerm_role_assignment.apim




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api-mgmt.data.azurerm_api_management.apim will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_api_management" "apim"  {
      ~ additional_location       = [] -> (known after apply)
      ~ developer_portal_url      = "https://sds-api-mgmt-test.developer.azure-api.net" -> (known after apply)
      ~ gateway_regional_url      = "https://sds-api-mgmt-test-uksouth-01.regional.azure-api.net" -> (known after apply)
      ~ gateway_url               = "https://sds-api-mgmt-test.azure-api.net" -> (known after apply)
      ~ hostname_configuration    = [
          - {
              - developer_portal = []
              - management       = []
              - portal           = []
              - proxy            = [
                  - {
                      - default_ssl_binding          = false
                      - host_name                    = "sds-api-mgmt-test.azure-api.net"
                      - key_vault_id                 = ""
                      - negotiate_client_certificate = false
                    },
                  - {
                      - default_ssl_binding          = true
                      - host_name                    = "sds-api-mgmt.test.platform.hmcts.net"
                      - key_vault_id                 = "https://acmedtssdstest.vault.azure.net/secrets/wildcard-test-platform-hmcts-net"
                      - negotiate_client_certificate = true
                    },
                  - {
                      - default_ssl_binding          = true
                      - host_name                    = "sds-api-mgmt-appgw.test.platform.hmcts.net"
                      - key_vault_id                 = "https://acmedtssdstest.vault.azure.net/secrets/wildcard-test-platform-hmcts-net"
                      - negotiate_client_certificate = true
                    },
                ]
              - scm              = []
            },
        ] -> (known after apply)
      ~ id                        = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-test" -> (known after apply)
      ~ identity                  = [
          - {
              - identity_ids = []
              - principal_id = "e5f39366-8b7a-475b-9be5-3cf20f135f71"
              - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
              - type         = "SystemAssigned"
            },
        ] -> (known after apply)
      ~ location                  = "uksouth" -> (known after apply)
      ~ management_api_url        = "https://sds-api-mgmt-test.management.azure-api.net" -> (known after apply)
        name                      = "sds-api-mgmt-test"
      ~ notification_sender_email = "apimgmt-noreply@mail.windowsazure.com" -> (known after apply)
      ~ portal_url                = "https://sds-api-mgmt-test.portal.azure-api.net" -> (known after apply)
      ~ private_ip_addresses      = [
          - "10.141.33.133",
        ] -> (known after apply)
      + public_ip_address_id      = (known after apply)
      ~ public_ip_addresses       = [
          - "20.77.79.42",
        ] -> (known after apply)
      ~ publisher_email           = "DTSPlatformOps@HMCTS.NET" -> (known after apply)
      ~ publisher_name            = "HMCTS Platform Operations" -> (known after apply)
      ~ scm_url                   = "https://sds-api-mgmt-test.scm.azure-api.net" -> (known after apply)
      ~ sku_name                  = "Developer_1" -> (known after apply)
      ~ tags                      = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/sds-azure-platform"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Medium"
          - "environment"  = "testing"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain must be replaced
-/+ resource "azurerm_api_management_custom_domain" "api-management-custom-domain" {
      ~ api_management_id = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-test" -> (known after apply) # forces replacement
      ~ id                = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-test/customDomains/default" -> (known after apply)

      ~ gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + expiry                       = (known after apply)
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + expiry                       = (known after apply)
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.api-mgmt.azurerm_public_ip.apim will be updated in-place
  ~ resource "azurerm_public_ip" "apim" {
      + ddos_protection_mode    = "VirtualNetworkInherited"
        id                      = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/publicIPAddresses/sds-api-mgmt-test-private-pip"
        name                    = "sds-api-mgmt-test-private-pip"
        tags                    = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "testing"
        }
        # (12 unchanged attributes hidden)
    }

  # module.api-mgmt.azurerm_role_assignment.apim must be replaced
-/+ resource "azurerm_role_assignment" "apim" {
      ~ id                               = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/sds-platform-test-rg/providers/Microsoft.KeyVault/vaults/acmedtssdstest/providers/Microsoft.Authorization/roleAssignments/b9d4861c-a6fa-59bd-4bef-7df4cdb54da3" -> (known after apply)
      ~ name                             = "b9d4861c-a6fa-59bd-4bef-7df4cdb54da3" -> (known after apply)
      ~ principal_id                     = "e5f39366-8b7a-475b-9be5-3cf20f135f71" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.api-mgmt.azurerm_application_insights.apim has been changed
  ~ resource "azurerm_application_insights" "apim" {
        id                                    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Insights/components/sds-api-mgmt-test"
        name                                  = "sds-api-mgmt-test"
        tags                                  = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "testing"
        }
        # (15 unchanged attributes hidden)
    }
  # module.api-mgmt.azurerm_api_management.apim has been changed
  ~ resource "azurerm_api_management" "apim" {
        id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-test"
        name                          = "sds-api-mgmt-test"
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "testing"
        }
        # (20 unchanged attributes hidden)

      ~ hostname_configuration {

          ~ proxy {
              + certificate_source           = "BuiltIn"
                # (3 unchanged attributes hidden)
            }
          ~ proxy {
              + certificate_source           = "KeyVault"
                # (7 unchanged attributes hidden)
            }
          ~ proxy {
              + certificate_source           = "KeyVault"
                # (7 unchanged attributes hidden)
            }
        }







        # (7 unchanged blocks hidden)
    }
  # module.api-mgmt.azurerm_api_management_api.apim has been changed
  ~ resource "azurerm_api_management_api" "apim" {
      + api_type              = "http"
        id                    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-test/apis/health"
        name                  = "health"
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain has been changed
  ~ resource "azurerm_api_management_custom_domain" "api-management-custom-domain" {
        id                = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-test/customDomains/default"
        # (1 unchanged attribute hidden)

      ~ gateway {
            # (4 unchanged attributes hidden)
        }
      ~ gateway {
            # (4 unchanged attributes hidden)
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":173,"Program":"tfcmt","SHA1":"","Target":"test-apim","Vars":{}} -->